from game import *


# Гра Морський бій:
# 1. Етап - рзстановка
# Гравець по черзі розставляє кораблі по полю у наступній послідовності
# - 1 чотирипалубний
# - 2 трипалубних
# - 3 двопалубних
# - 4 однопалубних
# навігація по полю здійснюється клавішами вниз, вверх, вправо, вліво
# спейс - щоб повернути корабель, s - щоб встановити корабель на позиції
# після встановлення чергового корабля на полі спавниться наступний.
# Коли всі кораблі встановлено розпоченається наступний етап.
# 2. Етап - гра
# В терміналі зявляється два поля - одне з кораблями гравця, інше поле (пусте),
# на якому відображуються ходи гравця, і на якому заховані кораблі компютера
# Першим ходить гравець, вводячи координати у форматі 1a - 0j, якщо хід був
# вдалим на полі ходів за вказаною координатою зявляється символ Х, якщо ні - *.
# У випадку промаху хід переходить до компютера. Якщо корабель було знищено, то
# гравець отримає повідомлення у терміналі. Гра триває до тих пір поки всі кораблі
# гравця або компютера не буде знищено

# Потребує стороннього модуля: pynput

new_game = Game()
new_game.start_game('player_1')
